src/cf/DocumentJournals/ЗаявкиКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DocumentJournal>
		<Properties>
			<Name>ЗаявкиКабинетСотрудника</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника</xr:Item>
				<xr:Item>Document.ОбращениеКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника</xr:Item>
				<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.Организация</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сотрудник</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.Сотрудник</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.Сотрудник</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ДатаСоздания</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.ДатаСоздания</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СрокИсполнения</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.СрокИсполнения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.РезультатВыполнения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Выполнена</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.Выполнена</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.Выполнена</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ТипЗаявки</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.ТипЗаявки</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ЗаявкаОтпускКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаОтпускБезОплатыКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаПрежняяВерсияКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаИзменениеЛичныхДанныхКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаНалоговыеВычетыКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаОтсутствиеКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаСправка2НДФЛКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОбращениеКабинетСотрудника.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ЗаявкаСоциальноеПособиеКабинетСотрудника.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/cf/Enums/ТипыЗаявокКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыЗаявокКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СправкаНДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаКомпенсациюОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеЛичныхДанных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаУдержаниеДСВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаСМестаРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СправкаОбОстаткеОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаявлениеНаНалоговыеВычеты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласованиеОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращениеСотрудника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускБезОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйОтпуск</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомпенсацияОтпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Болезнь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоБеременностиИРодам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпозданиеЛичныеДела</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтпускПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгул</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДниУходаЗаДетьмиИнвалидами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПособиеПриРожденииРебенка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕжемесячноеПособиеПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзОтпускаПоУходуЗаРебенком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DocumentJournals/ЗаявкиКабинетСотрудника/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(Ссылка)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТипыЗаявокДляВыбора() Экспорт

	ТипЗаявкиМенеджер = Перечисления.ТипыЗаявокКабинетСотрудника;
	
	ТипыЗаявок = Новый Массив;
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Отпуск);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускБезОплаты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЗаявлениеНаНалоговыеВычеты);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.СправкаНДФЛ);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.Болезнь);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОтпускПоБеременностиИРодам);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ИзменениеЛичныхДанных);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ОбращениеСотрудника);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ПособиеПриРожденииРебенка);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ЕжемесячноеПособиеПоУходуЗаРебенком);
	ТипыЗаявок.Добавить(ТипЗаявкиМенеджер.ВозвратИзОтпускаПоУходуЗаРебенком);
	
	Возврат ТипыЗаявок;

КонецФункции

#КонецОбласти

#КонецЕсли
